src/BusinessProcesses/аДокументооборотКорпоративныйБизнесПроцесс/аДокументооборотКорпоративныйБизнесПроцесс.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:BusinessProcess xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>аДокументооборотКорпоративныйБизнесПроцесс</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <task>Checked</task>
  </extension>
  <task>Task.аДокументооборотЗадача</task>
  <attributes>
    <name>Автор</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидПроцесса</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>CatalogRef.аДокументооборотВидыПроцессов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДайджестСсылокНаОбъекты</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>512</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗавершения</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДействиеПараллельное</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИднАвтора</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИднКонтролера</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Контролер</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Наименование</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТочкаВозвратаВВышестоящийПроцесс</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>CatalogRef.аДокументооборотТочкиКорпоративныхПроцессов</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеКартыПроцесса</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеТекстаПроцесса</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ВизуальнаяСхемаСкопирована</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>UIDВМобильномКлиенте</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ОсновныеИсполнители</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>ТочкаАдресации</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>AnyRef</types>
      </type>
    </attributes>
    <attributes>
      <name>ОтчетИсполнителя</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>CatalogRef.аДокументооборотТребуемыеРезультатыИсполнителей</types>
      </type>
    </attributes>
    <attributes>
      <name>СрокВыполненияТекст</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИндивидуальныйТекстЗадания</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИндивидуальноеНаименованиеЗадания</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СрокВыполненияЧасов</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидНаправленияПараллельное</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НеИспользоватьГрафикРаботы</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ИднИсполнителя</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СрокВыполненияДатаВремя</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ЭтоЗадачаРуководителю</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СетьМаршрутныхТочек</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>ТочкаВыход</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>CatalogRef.аДокументооборотТочкиКорпоративныхПроцессов</types>
      </type>
    </attributes>
    <attributes>
      <name>ТочкаВход</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>CatalogRef.аДокументооборотТочкиКорпоративныхПроцессов</types>
      </type>
    </attributes>
    <attributes>
      <name>УсловныйПереход</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеРеквизита</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИмяЛинииНаСхеме</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УсловиеПерехода</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УсловиеПереходаНаименование</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПроектыБизнесПроцесса</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>Проект</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>CatalogRef.Проекты</types>
      </type>
    </attributes>
    <attributes>
      <name>Примечание</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:BusinessProcess>

src/InformationRegisters/аДокументооборотСсылкиПроцессов/аДокументооборотСсылкиПроцессов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>аДокументооборотСсылкиПроцессов</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <dimensions>
    <name>Объект</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>AnyRef</types>
    </type>
  </dimensions>
  <dimensions>
    <name>БизнесПроцесс</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>BusinessProcessRef.аДокументооборотКорпоративныйБизнесПроцесс</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/pcru_ЗадачиПоДокументам/pcru_ЗадачиПоДокументам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>pcru_ЗадачиПоДокументам</name>
  <resources>
    <name>Инициатор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>Порядок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаВыполненияФакт</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Согласовано</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТекстовыйРезультат</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПричинаПереадресации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef.аДокументооборотКорпоративныйДокумент</types>
    </type>
  </dimensions>
  <dimensions>
    <name>БизнесПроцесс</name>
    <type>
      <types>BusinessProcessRef.аДокументооборотКорпоративныйБизнесПроцесс</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПереадресованоДругому</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Переадресант</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/pcru_ИсполнителиПоДокументам/pcru_ИсполнителиПоДокументам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>pcru_ИсполнителиПоДокументам</name>
  <resources>
    <name>Порядок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Согласовано</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТекстовыйРезультат</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef.аДокументооборотКорпоративныйДокумент</types>
    </type>
  </dimensions>
  <dimensions>
    <name>БизнесПроцесс</name>
    <type>
      <types>BusinessProcessRef.аДокументооборотКорпоративныйБизнесПроцесс</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/BusinessProcesses/аДокументооборотКорпоративныйБизнесПроцесс/ObjectModule.bsl
&После("ПриЗаписи")
Процедура Pcru_ПриЗаписи(Отказ)
	#Область  _1
	Если ЭтотОбъект.Стартован Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	аДокументооборотСсылкиПроцессов.Объект
		|ИЗ
		|	РегистрСведений.аДокументооборотСсылкиПроцессов КАК аДокументооборотСсылкиПроцессов
		|ГДЕ
		|	аДокументооборотСсылкиПроцессов.БизнесПроцесс = &БизнесПроцесс";
		Запрос.УстановитьПараметр("БизнесПроцесс",ЭтотОбъект.Ссылка );
		Выборка = Запрос.Выполнить().Выбрать();
		СписокОбъектов = Новый  СписокЗначений;
		Пока Выборка.Следующий() Цикл
			СписокОбъектов.Добавить(Выборка.Объект);
		КонецЦикла;
		СсылкаНаПроцесс  = ЭтотОбъект.Ссылка;    
		Если СписокОбъектов.Количество() =0 Тогда
			Возврат;
		КонецЕсли; 
		
		Попытка
			НЗ = РегистрыСведений.pcru_ЗадачиПоДокументам.СоздатьНаборЗаписей();
			НЗ.Отбор.Документ.Установить(СписокОбъектов[0].Значение, Истина);
			НЗ.Прочитать();
		Исключение
			Возврат;
		КонецПопытки;
		Если НЗ.Количество() = 0 Тогда
		Иначе	
			Индекс = 0;
			Для каждого Запись  Из НЗ Цикл
				Запись.БизнесПроцесс = СсылкаНаПроцесс;
				Запись.Согласовано = "Не выдано";
				Запись.ТекстовыйРезультат = "Не выдано";
			КонецЦикла; 
		КонецЕсли; 
		НЗ.Записать(Истина);
		
		 Попытка
			НЗ = РегистрыСведений.pcru_ИсполнителиПоДокументам.СоздатьНаборЗаписей();
			НЗ.Отбор.Документ.Установить(СписокОбъектов[0].Значение, Истина);
			НЗ.Прочитать();
		Исключение
			Возврат;
		КонецПопытки;
		Если НЗ.Количество() = 0 Тогда
		Иначе	
			Индекс = 0;
			Для каждого Запись  Из НЗ Цикл
				Запись.БизнесПроцесс = СсылкаНаПроцесс;
				Запись.Согласовано = "Не выдано";
				Запись.ТекстовыйРезультат = "Не выдано";
			КонецЦикла; 
		КонецЕсли; 
		НЗ.Записать(Истина);
	КонецЕсли; 
	
	Если ЭтотОбъект.Завершен Тогда
		Попытка
			НЗ = РегистрыСведений.pcru_ЗадачиПоДокументам.СоздатьНаборЗаписей();
			НЗ.Отбор.БизнесПроцесс.Установить(ЭтотОбъект.Ссылка, Истина);
			НЗ.Прочитать();
			НЗ.Очистить();
			НЗ.Записать(Истина);
		Исключение
		КонецПопытки;
		
		
		Попытка
			НЗ = РегистрыСведений.pcru_ИсполнителиПоДокументам.СоздатьНаборЗаписей();
			НЗ.Отбор.БизнесПроцесс.Установить(ЭтотОбъект.Ссылка, Истина);
			НЗ.Прочитать();
			НЗ.Очистить();
			НЗ.Записать(Истина);
		Исключение
		КонецПопытки;
	КонецЕсли; 	
	
	
	
	
	
	#КонецОбласти
	
КонецПроцедуры
